user_month = 0
while not 1 <= user_month <= 12:
    user_month = int(input('Введите число месяца: '))

# seasons = {'зима': [12, 1, 2], 'весна': [3, 4, 5], 'лето': [6, 7, 8], 'осень': [9, 10, 11]}
# for season, a in seasons.items():
#     if user_month in a:
#         print(f'Ваше время года {season}')

seasons = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
print(f'Ваше время года {seasons[user_month-1]}')

seasons = {
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень',
    12: 'зима',
}
print(f'Ваше время года {seasons.get(user_month)}')
